In [4]:
import pandas as pd

In [5]:
Departments_data = {
'id': [1, 2, 3],
    'name': ['HR', 'Engineering', 'Sales']

}

Employees_data = {
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'dept_id': [1, 2, 1, 3, 2, 3]

}
departments_data_df = pd.DataFrame(Departments_data)
employees_data_df = pd.DataFrame(Employees_data)

In [6]:
departments_data_df

   id         name
0   1           HR
1   2  Engineering
2   3        Sales

In [7]:
employees_data_df

   id     name  dept_id
0   1    Alice        1
1   2      Bob        2
2   3  Charlie        1
3   4    David        3
4   5      Eve        2
5   6    Frank        3

In [8]:
hr_dept_id = departments_data_df.loc[departments_data_df['name'] == 'HR', 'id'].values[0]

In [14]:
hr_dept_id

np.int64(1)

In [10]:
hr_employees = employees_data_df[employees_data_df['dept_id'] == hr_dept_id]

In [15]:
hr_employees

   id     name  dept_id
0   1    Alice        1
2   3  Charlie        1

In [16]:
hr_employee_names = hr_employees['name']

In [17]:
hr_employee_names

0      Alice
2    Charlie
Name: name, dtype: object

In [ ]:
"""
SELECT name FROM employees_data WHERE dept_id IN (SELECT id FROM departments_data WHERE name = 'HR');
"""

In [ ]:
"""SELECT name  FROM employees_data e WHERE EXISTS (SELECT 1 
    FROM departments_data d
    WHERE d.id = e.dept_id AND d.name = 'HR'
);
"""

In [18]:
hr_employee_names = employees_data_df[employees_data_df['dept_id'].isin( 
    departments_data_df[departments_data_df['name'] == 'HR']['id']
)]['name']

In [19]:
hr_employee_names

0      Alice
2    Charlie
Name: name, dtype: object

In [26]:
import sqlite3

conn =  sqlite3.connect('test.db')

cursor = conn.cursor()

cursor.execute("""CREATE TABLE IF NOT EXISTS users (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100)
)
""")

conn.commit()

In [33]:
cursor.execute("""INSERT INTO users (name, email) VALUES ("Niranjan","niranjan@example.com")""")

In [34]:
conn.commit()

In [36]:
cursor.execute("SELECT * FROM users")
for row in cursor.fetchall():
    print(row)

(None, 'Niranjan', 'niranjan@example.com')